Config/Catalogs/СтавкиОплатыОбразование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>СтавкиОплатыОбразование</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыСтавокОплат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоФиксированнаяСтавкаЗаПериод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаФиксированнаяСтавкаЗаПериод</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаФиксированнаяСтавкаЗаМесяц</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПеременнаяСтавкаЗаМесяц</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаСтавкаЗаДень</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПорядокНачисления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПериодНачисления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНачисления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Enums/СтатусыСтавокОплат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыСтавокОплат</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Подготовлено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Действует</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыто</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Documents/ПлановыеПоступленияОплатыРодительскаяПлата.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПлановыеПоступленияОплатыРодительскаяПлата</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ПлановыеДатыОплатыРодительскойПлаты</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РодительскаяПлатаДопУслуги</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетЗаНесколькоМесяцев</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаДетскогоУчреждения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыДетскогоУчреждения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиРасчетовПоРодительскойПлате</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КЭК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КОСГУ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Дети</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>АвтоРасчет</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аннуляция</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГруппаДетскогоУчреждения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ГруппыДетскогоУчреждения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ребенок</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Дети</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоговорКонтрагента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаОплаты</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтавкиОплатыОбразование</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Льгота</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛьготыСтудентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачалоПериода</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонецПериода</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДнейПосещенияПоГрафику</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДнейПосещенияКОплате</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПоДоговору</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Задолженность</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОплаты</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИДСтроки</Name>
							<Comment>Идентификатор строки - для связи с документов "Квитанция на оплату"</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/Catalogs/СтавкиОплатыОбразование/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт
	
	Результат = Новый Массив;
	
	Результат.Добавить("Наименование");
	Результат.Добавить("ДатаНачалаДействия");
	Результат.Добавить("ДатаОкончанияДействия; УстановитьИнтервал");
	Результат.Добавить("Валюта");
	Результат.Добавить("ЭтоФиксированнаяСтавкаЗаПериод");
	Результат.Добавить("СуммаФиксированнаяСтавкаЗаПериод");
	Результат.Добавить("СуммаФиксированнаяСтавкаЗаМесяц");
	Результат.Добавить("СуммаПеременнаяСтавкаЗаМесяц");
	Результат.Добавить("СуммаСтавкаЗаДень");
	Результат.Добавить("ПорядокНачисления; ПорядокНачисленияРаспределитьПоПериодам");
		
	Возврат Результат;
	
КонецФункции

// Функция возвращает таблицу реквизитов, зависимых от вида ставок
//
Функция ПолучитьМассивыРеквизитов(Объект, МассивВсехРеквизитов, МассивРеквизитовОперации) Экспорт
	
	МассивВсехРеквизитов = Новый Массив;
	МассивВсехРеквизитов.Добавить("СуммаФиксированнаяСтавкаЗаПериод");
	МассивВсехРеквизитов.Добавить("СуммаФиксированнаяСтавкаЗаМесяц");
	МассивВсехРеквизитов.Добавить("СуммаПеременнаяСтавкаЗаМесяц");
	МассивВсехРеквизитов.Добавить("СуммаСтавкаЗаДень");
	МассивВсехРеквизитов.Добавить("ПорядокНачисления");
	
	МассивРеквизитовОперации = Новый Массив;
	
	Если Объект.ЭтоФиксированнаяСтавкаЗаПериод Тогда
		
		МассивРеквизитовОперации.Добавить("СуммаФиксированнаяСтавкаЗаПериод");
		МассивРеквизитовОперации.Добавить("ПорядокНачисления");
		
	Иначе
		
		МассивРеквизитовОперации.Добавить("СуммаФиксированнаяСтавкаЗаМесяц");
		МассивРеквизитовОперации.Добавить("СуммаПеременнаяСтавкаЗаМесяц");
		МассивРеквизитовОперации.Добавить("СуммаСтавкаЗаДень");	
		
	КонецЕсли; 
	
КонецФункции

Функция РеквизитыНеРедактируемыеВГрупповойОбработке() Экспорт 

	Результат = Новый Массив;
	Результат.Добавить("ЭтоФиксированнаяСтавкаЗаПериод");
	Результат.Добавить("СуммаФиксированнаяСтавкаЗаПериод");
	Результат.Добавить("СуммаФиксированнаяСтавкаЗаМесяц");
	Результат.Добавить("СуммаПеременнаяСтавкаЗаМесяц");
	Результат.Добавить("СуммаСтавкаЗаДень");
		
	Возврат Результат;

КонецФункции

Функция ПроведенныеДокументыИспользуютСтавку(СтавкаСсылка) Экспорт
	
	Если НЕ ЗначениеЗаполнено(СтавкаСсылка) Тогда
		Возврат Ложь;
	КонецЕсли;	
	
	Запрос = Новый Запрос ("ВЫБРАТЬ ПЕРВЫЕ 1
	|	НачислениеЗаУслугиОбразованияНачисления.Ссылка
	|ИЗ
	|	Документ.НачислениеЗаУслугиОбразования.Начисления КАК НачислениеЗаУслугиОбразованияНачисления
	|ГДЕ
	|	НачислениеЗаУслугиОбразованияНачисления.СтавкаОплаты = &СтавкаОплаты
	|	И НачислениеЗаУслугиОбразованияНачисления.Ссылка.Проведен = ИСТИНА
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПлановыеПоступленияОплатыРодительскаяПлатаДети.Ссылка
	|ИЗ
	|	Документ.ПлановыеПоступленияОплатыРодительскаяПлата.Дети КАК ПлановыеПоступленияОплатыРодительскаяПлатаДети
	|ГДЕ
	|	ПлановыеПоступленияОплатыРодительскаяПлатаДети.СтавкаОплаты = &СтавкаОплаты
	|	И ПлановыеПоступленияОплатыРодительскаяПлатаДети.Ссылка.Проведен = ИСТИНА
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПлановыеПоступленияОплатыРодительскаяПлатаДети.Ссылка
	|ИЗ
	|	Документ.ПлановыеПоступленияОплатыРодительскаяПлата.Дети КАК ПлановыеПоступленияОплатыРодительскаяПлатаДети
	|ГДЕ
	|	ПлановыеПоступленияОплатыРодительскаяПлатаДети.СтавкаОплаты = &СтавкаОплаты
	|	И ПлановыеПоступленияОплатыРодительскаяПлатаДети.Ссылка.Проведен = ИСТИНА");
	
	Запрос.УстановитьПараметр("СтавкаОплаты", СтавкаСсылка);
	
	Возврат НЕ Запрос.Выполнить().Пустой();	
	
КонецФункции	

#КонецОбласти	
	
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Перем ВыбиратьСОграничением;
	Перем Период;
	
	Если Параметры.Свойство("ВыбиратьСОграничением", ВыбиратьСОграничением) И ВыбиратьСОграничением = Истина Тогда
		Если Параметры.Свойство("Период", Период) И ТипЗнч(Период) = Тип("Дата") Тогда
			
			СтандартнаяОбработка = Ложь;
			
			Запрос = Новый Запрос;                
			ТекстЗапроса = "ВЫБРАТЬ
						   |	СтавкиОплатыОбразование.Ссылка
						   |ИЗ
						   |	Справочник.СтавкиОплатыОбразование КАК СтавкиОплатыОбразование
						   |ГДЕ
						   |	НЕ СтавкиОплатыОбразование.ПометкаУдаления
						   |	И СтавкиОплатыОбразование.Состояние = ЗНАЧЕНИЕ(Перечисление.СтатусыСтавокОплат.Действует)
						   |	И СтавкиОплатыОбразование.ДатаНачалаДействия <= &Период
						   |	И СтавкиОплатыОбразование.ДатаОкончанияДействия >= &Период";
			Запрос.Текст = ТекстЗапроса;		
			Запрос.УстановитьПараметр("Период", Период);
			
			ДанныеВыбора = Новый СписокЗначений;
			ДанныеВыбора.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
			
		КонецЕсли; 		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
